Table of Contents
 Class Point3D
Namespace
IdeaRS.OpenModel.Geometry3D
Assembly
IdeaRS.OpenModel.dll
Represents an x- , y- an z-coordinates in three-dimensional space.
[OpenModelClass("CI.Geometry3D.Point3D,CI.Geometry3D", "CI.Geometry3D.IPoint3D,CI.BasicTypes")]
[DataContract]
public class Point3D : OpenElementId
Inheritance
object
OpenObject
OpenElementId
Point3D
Derived
RebarPoint3D
Inherited Members
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 Name
Gets or sets the Name
public string Name { get; set; }
Property Value
string
 X
Gets or sets the X-coordinate value
[DataMember]
public double X { get; set; }
Property Value
double
 Y
Gets or sets the Y-coordinate value
[DataMember]
public double Y { get; set; }
Property Value
double
 Z
Gets or sets the Z-coordinate value
[DataMember]
public double Z { get; set; }
Property Value
double
 Edit this page